[NoCoverage] BlockStatement
src/topics/bookmarks.js:54:45
-               if (bookmark === data.bookmark) {
-                   return;
-               }
+               if (bookmark === data.bookmark) {}

[NoCoverage] BlockStatement
src/topics/bookmarks.js:59:58
-               if (settings.topicPostSort === 'most_votes') {
-                   return;
-               }
+               if (settings.topicPostSort === 'most_votes') {}

[NoCoverage] StringLiteral
src/topics/create.js:31:52
-               slug: `${tid}/${slugify(data.title) || 'topic'}`,
+               slug: `${tid}/${slugify(data.title) || ""}`,

[NoCoverage] BlockStatement
src/topics/create.js:128:55
-           if (!Array.isArray(topics) || !topics.length) {
-               throw new Error('[[error:no-topic]]');
-           }
+           if (!Array.isArray(topics) || !topics.length) {}

[NoCoverage] StringLiteral
src/topics/create.js:129:29
-               throw new Error('[[error:no-topic]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/create.js:188:54
-           if (uid > 0 && settings.followTopicsOnReply) {
-               await Topics.follow(postData.tid, uid);
-           }
+           if (uid > 0 && settings.followTopicsOnReply) {}

[NoCoverage] BlockStatement
src/topics/create.js:264:53
-           } else if (item.length > parseInt(max, 10)) {
-               throw new Error(`[[error:${maxError}, ${max}]]`);
-           }
+           } else if (item.length > parseInt(max, 10)) {}

[NoCoverage] StringLiteral
src/topics/create.js:265:29
-               throw new Error(`[[error:${maxError}, ${max}]]`);
+               throw new Error(``);

[NoCoverage] BlockStatement
src/topics/create.js:271:73
-               if (data.handle.length > meta.config.maximumUsernameLength) {
-                   throw new Error('[[error:guest-handle-invalid]]');
-               }
+               if (data.handle.length > meta.config.maximumUsernameLength) {}

[NoCoverage] StringLiteral
src/topics/create.js:272:33
-                   throw new Error('[[error:guest-handle-invalid]]');
+                   throw new Error("");

[NoCoverage] BlockStatement
src/topics/create.js:275:25
-               if (exists) {
-                   throw new Error('[[error:username-taken]]');
-               }
+               if (exists) {}

[NoCoverage] StringLiteral
src/topics/create.js:276:33
-                   throw new Error('[[error:username-taken]]');
+                   throw new Error("");

[NoCoverage] BooleanLiteral
src/topics/create.js:294:23
-           if (locked && !isAdminOrMod) {
+           if (locked && isAdminOrMod) {

[NoCoverage] BlockStatement
src/topics/create.js:294:38
-           if (locked && !isAdminOrMod) {
-               throw new Error('[[error:topic-locked]]');
-           }
+           if (locked && !isAdminOrMod) {}

[NoCoverage] StringLiteral
src/topics/create.js:295:29
-               throw new Error('[[error:topic-locked]]');
+               throw new Error("");

[NoCoverage] BooleanLiteral
src/topics/create.js:298:38
-           if (!scheduled && deleted && !isAdminOrMod) {
+           if (!scheduled && deleted && isAdminOrMod) {

[NoCoverage] BlockStatement
src/topics/create.js:298:53
-           if (!scheduled && deleted && !isAdminOrMod) {
-               throw new Error('[[error:topic-deleted]]');
-           }
+           if (!scheduled && deleted && !isAdminOrMod) {}

[NoCoverage] StringLiteral
src/topics/create.js:299:29
-               throw new Error('[[error:topic-deleted]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/create.js:302:40
-           if (scheduled && !canSchedule) {
-               throw new Error('[[error:no-privileges]]');
-           }
+           if (scheduled && !canSchedule) {}

[NoCoverage] StringLiteral
src/topics/create.js:303:29
-               throw new Error('[[error:no-privileges]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/data.js:60:51
-       Topics.getCategoryData = async function (tid) {
-           const cid = await Topics.getTopicField(tid, 'cid');
-           return await categories.getCategoryData(cid);
-       };
+       Topics.getCategoryData = async function (tid) {};

[NoCoverage] StringLiteral
src/topics/data.js:61:53
-           const cid = await Topics.getTopicField(tid, 'cid');
+           const cid = await Topics.getTopicField(tid, "");

[NoCoverage] BlockStatement
src/topics/delete.js:56:74
-           await batch.processSortedSet(`tid:${tid}:posts`, async (pids) => {
-               await posts.purge(pids, uid);
-           }, { alwaysStartAt: 0, batch: 500 });
+           await batch.processSortedSet(`tid:${tid}:posts`, async (pids) => {}, { alwaysStartAt: 0, batch: 500 });

[NoCoverage] BlockStatement
src/topics/delete.js:68:28
-           if (!deletedTopic) {
-               return;
-           }
+           if (!deletedTopic) {}

[NoCoverage] StringLiteral
src/topics/delete.js:107:49
-           const ignorerKeys = ignorers.map(uid => `uid:${uid}ignored_tids`);
+           const ignorerKeys = ignorers.map(uid => ``);

[NoCoverage] BlockStatement
src/topics/events.js:78:36
-       if (!await topics.exists(tid)) {
-           throw new Error('[[error:no-topic]]');
-       }
+       if (!await topics.exists(tid)) {}

[NoCoverage] StringLiteral
src/topics/events.js:79:25
-           throw new Error('[[error:no-topic]]');
+           throw new Error("");

[NoCoverage] ObjectLiteral
src/topics/events.js:116:49
-           events.push(...queuedPosts.map(item => ({
-               type: 'post-queue',
-               timestamp: item.data.timestamp || Date.now(),
-               uid: item.data.uid,
-           })));
+           events.push(...queuedPosts.map(item => ({})));

[NoCoverage] StringLiteral
src/topics/events.js:117:19
-               type: 'post-queue',
+               type: "",

[NoCoverage] ConditionalExpression
src/topics/events.js:118:24
-               timestamp: item.data.timestamp || Date.now(),
+               timestamp: true,

[NoCoverage] ConditionalExpression
src/topics/events.js:118:24
-               timestamp: item.data.timestamp || Date.now(),
+               timestamp: false,

[NoCoverage] LogicalOperator
src/topics/events.js:118:24
-               timestamp: item.data.timestamp || Date.now(),
+               timestamp: item.data.timestamp && Date.now(),

[NoCoverage] BlockStatement
src/topics/events.js:121:39
-           queuedPosts.forEach((item) => {
-               timestamps.push(item.data.timestamp || Date.now());
-           });
+           queuedPosts.forEach((item) => {});

[NoCoverage] ConditionalExpression
src/topics/events.js:122:29
-               timestamps.push(item.data.timestamp || Date.now());
+               timestamps.push(true);

[NoCoverage] ConditionalExpression
src/topics/events.js:122:29
-               timestamps.push(item.data.timestamp || Date.now());
+               timestamps.push(false);

[NoCoverage] LogicalOperator
src/topics/events.js:122:29
-               timestamps.push(item.data.timestamp || Date.now());
+               timestamps.push(item.data.timestamp && Date.now());

[NoCoverage] StringLiteral
src/topics/events.js:153:61
-               event.user = users.get(event.uid === 'system' ? 'system' : parseInt(event.uid, 10));
+               event.user = users.get(event.uid === 'system' ? "" : parseInt(event.uid, 10));

[NoCoverage] BlockStatement
src/topics/events.js:174:46
-       if (!Events._types.hasOwnProperty(type)) {
-           throw new Error(`[[error:topic-event-unrecognized, ${type}]]`);
-       } else if (!await topics.exists(tid)) {
+       if (!Events._types.hasOwnProperty(type)) {} else if (!await topics.exists(tid)) {

[NoCoverage] StringLiteral
src/topics/events.js:175:25
-           throw new Error(`[[error:topic-event-unrecognized, ${type}]]`);
+           throw new Error(``);

[NoCoverage] BlockStatement
src/topics/events.js:176:43
-       } else if (!await topics.exists(tid)) {
-           throw new Error('[[error:no-topic]]');
-       }
+       } else if (!await topics.exists(tid)) {}

[NoCoverage] StringLiteral
src/topics/events.js:177:25
-           throw new Error('[[error:no-topic]]');
+           throw new Error("");

[NoCoverage] BlockStatement
src/topics/follow.js:13:22
-           if (!exists) {
-               throw new Error('[[error:no-topic]]');
-           }
+           if (!exists) {}

[NoCoverage] StringLiteral
src/topics/follow.js:14:29
-               throw new Error('[[error:no-topic]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/follow.js:17:29
-           if (isFollowing[0]) {
-               await Topics.unfollow(tid, uid);
-           } else {
+           if (isFollowing[0]) {} else {

[NoCoverage] BlockStatement
src/topics/follow.js:85:35
-           if (!Array.isArray(tids)) {
-               return;
-           }
+           if (!Array.isArray(tids)) {}

[NoCoverage] BlockStatement
src/topics/follow.js:107:35
-           if (!Array.isArray(tids)) {
-               return;
-           }
+           if (!Array.isArray(tids)) {}

[NoCoverage] BlockStatement
src/topics/follow.js:121:47
-       Topics.getIgnorers = async function (tid) {
-           return await db.getSetMembers(`tid:${tid}:ignorers`);
-       };
+       Topics.getIgnorers = async function (tid) {};

[NoCoverage] StringLiteral
src/topics/follow.js:122:39
-           return await db.getSetMembers(`tid:${tid}:ignorers`);
+           return await db.getSetMembers(``);

[NoCoverage] BlockStatement
src/topics/follow.js:131:59
-       Topics.filterWatchedTids = async function (tids, uid) {
-           if (parseInt(uid, 10) <= 0) {
-               return [];
-           }
-           const scores = await db.sortedSetScores(`uid:${uid}:followed_tids`, tids);
-           return tids.filter((tid, index) => tid && !!scores[index]);
-       };
+       Topics.filterWatchedTids = async function (tids, uid) {};

[NoCoverage] ConditionalExpression
src/topics/follow.js:132:13
-           if (parseInt(uid, 10) <= 0) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/topics/follow.js:132:13
-           if (parseInt(uid, 10) <= 0) {
+           if (false) {

[NoCoverage] EqualityOperator
src/topics/follow.js:132:13
-           if (parseInt(uid, 10) <= 0) {
+           if (parseInt(uid, 10) < 0) {

[NoCoverage] EqualityOperator
src/topics/follow.js:132:13
-           if (parseInt(uid, 10) <= 0) {
+           if (parseInt(uid, 10) > 0) {

[NoCoverage] BlockStatement
src/topics/follow.js:132:37
-           if (parseInt(uid, 10) <= 0) {
-               return [];
-           }
+           if (parseInt(uid, 10) <= 0) {}

[NoCoverage] ArrayDeclaration
src/topics/follow.js:133:20
-               return [];
+               return ["Stryker was here"];

[NoCoverage] StringLiteral
src/topics/follow.js:135:49
-           const scores = await db.sortedSetScores(`uid:${uid}:followed_tids`, tids);
+           const scores = await db.sortedSetScores(``, tids);

[NoCoverage] MethodExpression
src/topics/follow.js:136:16
-           return tids.filter((tid, index) => tid && !!scores[index]);
+           return tids;

[NoCoverage] ArrowFunction
src/topics/follow.js:136:28
-           return tids.filter((tid, index) => tid && !!scores[index]);
+           return tids.filter(() => undefined);

[NoCoverage] ConditionalExpression
src/topics/follow.js:136:44
-           return tids.filter((tid, index) => tid && !!scores[index]);
+           return tids.filter((tid, index) => true);

[NoCoverage] ConditionalExpression
src/topics/follow.js:136:44
-           return tids.filter((tid, index) => tid && !!scores[index]);
+           return tids.filter((tid, index) => false);

[NoCoverage] LogicalOperator
src/topics/follow.js:136:44
-           return tids.filter((tid, index) => tid && !!scores[index]);
+           return tids.filter((tid, index) => tid || !!scores[index]);

[NoCoverage] BooleanLiteral
src/topics/follow.js:136:51
-           return tids.filter((tid, index) => tid && !!scores[index]);
+           return tids.filter((tid, index) => tid && !scores[index]);

[NoCoverage] BooleanLiteral
src/topics/follow.js:136:52
-           return tids.filter((tid, index) => tid && !!scores[index]);
+           return tids.filter((tid, index) => tid && !scores[index]);

[NoCoverage] BlockStatement
src/topics/fork.js:17:60
-           if (title.length < meta.config.minimumTitleLength) {
-               throw new Error(`[[error:title-too-short, ${meta.config.minimumTitleLength}]]`);
-           } else if (title.length > meta.config.maximumTitleLength) {
+           if (title.length < meta.config.minimumTitleLength) {} else if (title.length > meta.config.maximumTitleLength) {

[NoCoverage] StringLiteral
src/topics/fork.js:18:29
-               throw new Error(`[[error:title-too-short, ${meta.config.minimumTitleLength}]]`);
+               throw new Error(``);

[NoCoverage] BlockStatement
src/topics/fork.js:19:67
-           } else if (title.length > meta.config.maximumTitleLength) {
-               throw new Error(`[[error:title-too-long, ${meta.config.maximumTitleLength}]]`);
-           }
+           } else if (title.length > meta.config.maximumTitleLength) {}

[NoCoverage] StringLiteral
src/topics/fork.js:20:29
-               throw new Error(`[[error:title-too-long, ${meta.config.maximumTitleLength}]]`);
+               throw new Error(``);

[NoCoverage] BlockStatement
src/topics/fork.js:23:36
-           if (!pids || !pids.length) {
-               throw new Error('[[error:invalid-pid]]');
-           }
+           if (!pids || !pids.length) {}

[NoCoverage] StringLiteral
src/topics/fork.js:24:29
-               throw new Error('[[error:invalid-pid]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/fork.js:37:28
-           if (!isAdminOrMod) {
-               throw new Error('[[error:no-privileges]]');
-           }
+           if (!isAdminOrMod) {}

[NoCoverage] StringLiteral
src/topics/fork.js:38:29
-               throw new Error('[[error:no-privileges]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/fork.js:59:32
-               if (!canEdit.flag) {
-                   throw new Error(canEdit.message);
-               }
+               if (!canEdit.flag) {}

[NoCoverage] ArithmeticOperator
src/topics/fork.js:65:59
-           await Topics.updateLastPostTime(tid, scheduled ? (postData.timestamp + 1) : Date.now());
+           await Topics.updateLastPostTime(tid, scheduled ? (postData.timestamp - 1) : Date.now());

[NoCoverage] BlockStatement
src/topics/fork.js:84:29
-           if (!topicData.tid) {
-               throw new Error('[[error:no-topic]]');
-           }
+           if (!topicData.tid) {}

[NoCoverage] StringLiteral
src/topics/fork.js:85:29
-               throw new Error('[[error:no-topic]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/fork.js:87:53
-           if (!forceScheduled && topicData.scheduled) {
-               throw new Error('[[error:cant-move-posts-to-scheduled]]');
-           }
+           if (!forceScheduled && topicData.scheduled) {}

[NoCoverage] StringLiteral
src/topics/fork.js:88:29
-               throw new Error('[[error:cant-move-posts-to-scheduled]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/fork.js:91:41
-           if (!postData || !postData.tid) {
-               throw new Error('[[error:no-post]]');
-           }
+           if (!postData || !postData.tid) {}

[NoCoverage] StringLiteral
src/topics/fork.js:92:29
-               throw new Error('[[error:no-post]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/fork.js:96:56
-           if (!forceScheduled && isSourceTopicScheduled) {
-               throw new Error('[[error:cant-move-from-scheduled-to-existing]]');
-           }
+           if (!forceScheduled && isSourceTopicScheduled) {}

[NoCoverage] StringLiteral
src/topics/fork.js:97:29
-               throw new Error('[[error:cant-move-from-scheduled-to-existing]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/fork.js:100:35
-           if (postData.tid === tid) {
-               throw new Error('[[error:cant-move-to-same-topic]]');
-           }
+           if (postData.tid === tid) {}

[NoCoverage] StringLiteral
src/topics/fork.js:101:29
-               throw new Error('[[error:cant-move-to-same-topic]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/fork.js:123:53
-           if (!topicData[0].cid || !topicData[1].cid) {
-               return;
-           }
+           if (!topicData[0].cid || !topicData[1].cid) {}

[NoCoverage] BlockStatement
src/topics/fork.js:149:55
-           if (postData.votes > 0 || postData.votes < 0) {
-               tasks.push(db.sortedSetAdd(`cid:${topicData[1].cid}:uid:${postData.uid}:pids:votes`, postData.votes, postData.pid));
-           }
+           if (postData.votes > 0 || postData.votes < 0) {}

[NoCoverage] StringLiteral
src/topics/fork.js:150:40
-               tasks.push(db.sortedSetAdd(`cid:${topicData[1].cid}:uid:${postData.uid}:pids:votes`, postData.votes, postData.pid));
+               tasks.push(db.sortedSetAdd(``, postData.votes, postData.pid));

[NoCoverage] BlockStatement
src/topics/index.js:44:66
-   Topics.getTopicsFromSet = async function (set, uid, start, stop) {
-       const tids = await db.getSortedSetRevRange(set, start, stop);
-       const topics = await Topics.getTopics(tids, uid);
-       Topics.calculateTopicIndices(topics, start);
-       return { topics: topics, nextStart: stop + 1 };
-   };
+   Topics.getTopicsFromSet = async function (set, uid, start, stop) {};

[NoCoverage] ObjectLiteral
src/topics/index.js:48:12
-       return { topics: topics, nextStart: stop + 1 };
+       return {};

[NoCoverage] ArithmeticOperator
src/topics/index.js:48:41
-       return { topics: topics, nextStart: stop + 1 };
+       return { topics: topics, nextStart: stop - 1 };

[NoCoverage] MethodExpression
src/topics/index.js:142:17
-                   Math.max(1, topic.postcount + 2 - bookmarks[i]) :
+                   Math.min(1, topic.postcount + 2 - bookmarks[i]) :

[NoCoverage] ArithmeticOperator
src/topics/index.js:142:29
-                   Math.max(1, topic.postcount + 2 - bookmarks[i]) :
+                   Math.max(1, topic.postcount + 2 + bookmarks[i]) :

[NoCoverage] ArithmeticOperator
src/topics/index.js:142:29
-                   Math.max(1, topic.postcount + 2 - bookmarks[i]) :
+                   Math.max(1, topic.postcount - 2 - bookmarks[i]) :

[NoCoverage] ConditionalExpression
src/topics/index.js:190:22
-               event => event.timestamp >= p.eventStart && event.timestamp < p.eventEnd
+               event => true

[NoCoverage] ConditionalExpression
src/topics/index.js:190:22
-               event => event.timestamp >= p.eventStart && event.timestamp < p.eventEnd
+               event => false

[NoCoverage] LogicalOperator
src/topics/index.js:190:22
-               event => event.timestamp >= p.eventStart && event.timestamp < p.eventEnd
+               event => event.timestamp >= p.eventStart || event.timestamp < p.eventEnd

[NoCoverage] ConditionalExpression
src/topics/index.js:190:22
-               event => event.timestamp >= p.eventStart && event.timestamp < p.eventEnd
+               event => true && event.timestamp < p.eventEnd

[NoCoverage] EqualityOperator
src/topics/index.js:190:22
-               event => event.timestamp >= p.eventStart && event.timestamp < p.eventEnd
+               event => event.timestamp > p.eventStart && event.timestamp < p.eventEnd

[NoCoverage] EqualityOperator
src/topics/index.js:190:22
-               event => event.timestamp >= p.eventStart && event.timestamp < p.eventEnd
+               event => event.timestamp < p.eventStart && event.timestamp < p.eventEnd

[NoCoverage] ConditionalExpression
src/topics/index.js:190:57
-               event => event.timestamp >= p.eventStart && event.timestamp < p.eventEnd
+               event => event.timestamp >= p.eventStart && true

[NoCoverage] EqualityOperator
src/topics/index.js:190:57
-               event => event.timestamp >= p.eventStart && event.timestamp < p.eventEnd
+               event => event.timestamp >= p.eventStart && event.timestamp <= p.eventEnd

[NoCoverage] EqualityOperator
src/topics/index.js:190:57
-               event => event.timestamp >= p.eventStart && event.timestamp < p.eventEnd
+               event => event.timestamp >= p.eventStart && event.timestamp >= p.eventEnd

[NoCoverage] ArrayDeclaration
src/topics/index.js:212:36
-       topicData.related = related || [];
+       topicData.related = related || ["Stryker was here"];

[NoCoverage] BlockStatement
src/topics/merge.js:11:48
-           if (topicsData.some(t => t.scheduled)) {
-               throw new Error('[[error:cant-merge-scheduled]]');
-           }
+           if (topicsData.some(t => t.scheduled)) {}

[NoCoverage] StringLiteral
src/topics/merge.js:12:29
-               throw new Error('[[error:cant-merge-scheduled]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/posts.js:61:50
-           if (allPosts.length !== postData.length) {
-               const includedPids = new Set(postData.map(p => p.pid));
-               allPosts.reverse().forEach((p, index) => {
-                   if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
-                       allPosts[index + 1].eventEnd = p.eventEnd;
-                   }
-               });
-           }
+           if (allPosts.length !== postData.length) {}

[NoCoverage] ArrowFunction
src/topics/posts.js:62:55
-               const includedPids = new Set(postData.map(p => p.pid));
+               const includedPids = new Set(postData.map(() => undefined));

[NoCoverage] MethodExpression
src/topics/posts.js:63:13
-               allPosts.reverse().forEach((p, index) => {
+               allPosts.forEach((p, index) => {

[NoCoverage] BlockStatement
src/topics/posts.js:63:54
-               allPosts.reverse().forEach((p, index) => {
-                   if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
-                       allPosts[index + 1].eventEnd = p.eventEnd;
-                   }
-               });
+               allPosts.reverse().forEach((p, index) => {});

[NoCoverage] ConditionalExpression
src/topics/posts.js:64:21
-                   if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
+                   if (true) {

[NoCoverage] ConditionalExpression
src/topics/posts.js:64:21
-                   if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
+                   if (false) {

[NoCoverage] LogicalOperator
src/topics/posts.js:64:21
-                   if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
+                   if (!includedPids.has(p.pid) && allPosts[index + 1] || !reverse) {

[NoCoverage] ConditionalExpression
src/topics/posts.js:64:21
-                   if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
+                   if (true && !reverse) {

[NoCoverage] LogicalOperator
src/topics/posts.js:64:21
-                   if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
+                   if (!includedPids.has(p.pid) || allPosts[index + 1] && !reverse) {

[NoCoverage] BooleanLiteral
src/topics/posts.js:64:21
-                   if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
+                   if (includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {

[NoCoverage] ArithmeticOperator
src/topics/posts.js:64:58
-                   if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
+                   if (!includedPids.has(p.pid) && allPosts[index - 1] && !reverse) {

[NoCoverage] BooleanLiteral
src/topics/posts.js:64:72
-                   if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
+                   if (!includedPids.has(p.pid) && allPosts[index + 1] && reverse) {

[NoCoverage] BlockStatement
src/topics/posts.js:64:82
-                   if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {
-                       allPosts[index + 1].eventEnd = p.eventEnd;
-                   }
+                   if (!includedPids.has(p.pid) && allPosts[index + 1] && !reverse) {}

[NoCoverage] ArithmeticOperator
src/topics/posts.js:65:30
-                       allPosts[index + 1].eventEnd = p.eventEnd;
+                       allPosts[index - 1].eventEnd = p.eventEnd;

[NoCoverage] BlockStatement
src/topics/posts.js:79:31
-           if (!postData.length) {
-               return;
-           }
+           if (!postData.length) {}

[NoCoverage] ConditionalExpression
src/topics/posts.js:144:54
-                   if (meta.config.allowGuestHandles && postObj.uid === 0 && postObj.handle) {
+                   if (meta.config.allowGuestHandles && true && postObj.handle) {

[NoCoverage] EqualityOperator
src/topics/posts.js:144:54
-                   if (meta.config.allowGuestHandles && postObj.uid === 0 && postObj.handle) {
+                   if (meta.config.allowGuestHandles && postObj.uid !== 0 && postObj.handle) {

[NoCoverage] BlockStatement
src/topics/posts.js:144:91
-                   if (meta.config.allowGuestHandles && postObj.uid === 0 && postObj.handle) {
-                       postObj.user.username = validator.escape(String(postObj.handle));
-                       postObj.user.displayname = postObj.user.username;
-                   }
+                   if (meta.config.allowGuestHandles && postObj.uid === 0 && postObj.handle) {}

[NoCoverage] StringLiteral
src/topics/posts.js:163:109
-                   post.display_edit_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:edit']);
+                   post.display_edit_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges[""]);

[NoCoverage] StringLiteral
src/topics/posts.js:164:111
-                   post.display_delete_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges['posts:delete']);
+                   post.display_delete_tools = topicPrivileges.isAdminOrMod || (post.selfPost && topicPrivileges[""]);

[NoCoverage] ConditionalExpression
src/topics/posts.js:169:26
-                           ((!topicData.locked && !post.deleted) ||
-                           (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
+                           (true)) ||

[NoCoverage] LogicalOperator
src/topics/posts.js:169:26
-                           ((!topicData.locked && !post.deleted) ||
-                           (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
+                           (!topicData.locked && !post.deleted && post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10))) ||

[NoCoverage] ConditionalExpression
src/topics/posts.js:169:27
-                           ((!topicData.locked && !post.deleted) ||
+                           ((false) ||

[NoCoverage] LogicalOperator
src/topics/posts.js:169:27
-                           ((!topicData.locked && !post.deleted) ||
+                           ((!topicData.locked || !post.deleted) ||

[NoCoverage] BooleanLiteral
src/topics/posts.js:169:27
-                           ((!topicData.locked && !post.deleted) ||
+                           ((topicData.locked && !post.deleted) ||

[NoCoverage] BooleanLiteral
src/topics/posts.js:169:48
-                           ((!topicData.locked && !post.deleted) ||
+                           ((!topicData.locked && post.deleted) ||

[NoCoverage] ConditionalExpression
src/topics/posts.js:170:26
-                           (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
+                           (false))) ||

[NoCoverage] LogicalOperator
src/topics/posts.js:170:26
-                           (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
+                           (post.deleted || parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||

[NoCoverage] ConditionalExpression
src/topics/posts.js:170:42
-                           (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
+                           (post.deleted && true))) ||

[NoCoverage] EqualityOperator
src/topics/posts.js:170:42
-                           (post.deleted && parseInt(post.deleterUid, 10) === parseInt(topicPrivileges.uid, 10)))) ||
+                           (post.deleted && parseInt(post.deleterUid, 10) !== parseInt(topicPrivileges.uid, 10)))) ||

[NoCoverage] ConditionalExpression
src/topics/posts.js:331:49
-           const uids = replyData.map(replyData => replyData && replyData.uid);
+           const uids = replyData.map(replyData => true);

[NoCoverage] ConditionalExpression
src/topics/posts.js:331:49
-           const uids = replyData.map(replyData => replyData && replyData.uid);
+           const uids = replyData.map(replyData => false);

[NoCoverage] LogicalOperator
src/topics/posts.js:331:49
-           const uids = replyData.map(replyData => replyData && replyData.uid);
+           const uids = replyData.map(replyData => replyData || replyData.uid);

[NoCoverage] StringLiteral
src/topics/posts.js:346:46
-                   text: replyPids.length > 1 ? `[[topic:replies_to_this_post, ${replyPids.length}]]` : '[[topic:one_reply_to_this_post]]',
+                   text: replyPids.length > 1 ? `` : '[[topic:one_reply_to_this_post]]',
