[NoCoverage] ArithmeticOperator
src/topics/posts.js:351:38
-               replyPids.sort((a, b) => parseInt(a, 10) - parseInt(b, 10));
+               replyPids.sort((a, b) => parseInt(a, 10) + parseInt(b, 10));

[NoCoverage] BlockStatement
src/topics/posts.js:353:45
-               replyPids.forEach((replyPid) => {
-                   const replyData = pidMap[replyPid];
-                   if (!uidsUsed[replyData.uid] && currentData.users.length < 6) {
-                       currentData.users.push(uidMap[replyData.uid]);
-                       uidsUsed[replyData.uid] = true;
-                   }
-               });
+               replyPids.forEach((replyPid) => {});

[NoCoverage] ConditionalExpression
src/topics/posts.js:355:21
-                   if (!uidsUsed[replyData.uid] && currentData.users.length < 6) {
+                   if (true) {

[NoCoverage] ConditionalExpression
src/topics/posts.js:355:21
-                   if (!uidsUsed[replyData.uid] && currentData.users.length < 6) {
+                   if (false) {

[NoCoverage] LogicalOperator
src/topics/posts.js:355:21
-                   if (!uidsUsed[replyData.uid] && currentData.users.length < 6) {
+                   if (!uidsUsed[replyData.uid] || currentData.users.length < 6) {

[NoCoverage] BooleanLiteral
src/topics/posts.js:355:21
-                   if (!uidsUsed[replyData.uid] && currentData.users.length < 6) {
+                   if (uidsUsed[replyData.uid] && currentData.users.length < 6) {

[NoCoverage] ConditionalExpression
src/topics/posts.js:355:49
-                   if (!uidsUsed[replyData.uid] && currentData.users.length < 6) {
+                   if (!uidsUsed[replyData.uid] && true) {

[NoCoverage] EqualityOperator
src/topics/posts.js:355:49
-                   if (!uidsUsed[replyData.uid] && currentData.users.length < 6) {
+                   if (!uidsUsed[replyData.uid] && currentData.users.length <= 6) {

[NoCoverage] EqualityOperator
src/topics/posts.js:355:49
-                   if (!uidsUsed[replyData.uid] && currentData.users.length < 6) {
+                   if (!uidsUsed[replyData.uid] && currentData.users.length >= 6) {

[NoCoverage] BlockStatement
src/topics/posts.js:355:79
-                   if (!uidsUsed[replyData.uid] && currentData.users.length < 6) {
-                       currentData.users.push(uidMap[replyData.uid]);
-                       uidsUsed[replyData.uid] = true;
-                   }
+                   if (!uidsUsed[replyData.uid] && currentData.users.length < 6) {}

[NoCoverage] BooleanLiteral
src/topics/posts.js:357:47
-                       uidsUsed[replyData.uid] = true;
+                       uidsUsed[replyData.uid] = false;

[NoCoverage] BlockStatement
src/topics/posts.js:361:47
-               if (currentData.users.length > 5) {
-                   currentData.users.pop();
-                   currentData.hasMore = true;
-               }
+               if (currentData.users.length > 5) {}

[NoCoverage] BooleanLiteral
src/topics/posts.js:363:39
-                   currentData.hasMore = true;
+                   currentData.hasMore = false;

[NoCoverage] BlockStatement
src/topics/posts.js:379:23
-           if (!matches) {
-               return 0;
-           }
+           if (!matches) {}

[NoCoverage] BlockStatement
src/topics/recent.js:16:77
-       Topics.getRecentTopics = async function (cid, uid, start, stop, filter) {
-           return await Topics.getSortedTopics({
-               cids: cid,
-               uid: uid,
-               start: start,
-               stop: stop,
-               filter: filter,
-               sort: 'recent',
-           });
-       };
+       Topics.getRecentTopics = async function (cid, uid, start, stop, filter) {};

[NoCoverage] ObjectLiteral
src/topics/recent.js:17:45
-           return await Topics.getSortedTopics({
-               cids: cid,
-               uid: uid,
-               start: start,
-               stop: stop,
-               filter: filter,
-               sort: 'recent',
-           });
+           return await Topics.getSortedTopics({});

[NoCoverage] StringLiteral
src/topics/recent.js:23:19
-               sort: 'recent',
+               sort: "",

[NoCoverage] ArithmeticOperator
src/topics/recent.js:41:58
-           const count = parseInt(stop, 10) === -1 ? stop : stop - start + 1;
+           const count = parseInt(stop, 10) === -1 ? stop : stop - start - 1;

[NoCoverage] ArithmeticOperator
src/topics/recent.js:41:58
-           const count = parseInt(stop, 10) === -1 ? stop : stop - start + 1;
+           const count = parseInt(stop, 10) === -1 ? stop : stop + start + 1;

[NoCoverage] BlockStatement
src/topics/recent.js:51:25
-           if (!timestamp) {
-               return;
-           }
+           if (!timestamp) {}

[NoCoverage] BlockStatement
src/topics/recent.js:72:71
-           if (plugins.hooks.hasListeners('filter:topics.updateRecent')) {
-               data = await plugins.hooks.fire('filter:topics.updateRecent', { tid: tid, timestamp: timestamp });
-           }
+           if (plugins.hooks.hasListeners('filter:topics.updateRecent')) {}

[NoCoverage] StringLiteral
src/topics/recent.js:73:45
-               data = await plugins.hooks.fire('filter:topics.updateRecent', { tid: tid, timestamp: timestamp });
+               data = await plugins.hooks.fire("", { tid: tid, timestamp: timestamp });

[NoCoverage] ObjectLiteral
src/topics/recent.js:73:75
-               data = await plugins.hooks.fire('filter:topics.updateRecent', { tid: tid, timestamp: timestamp });
+               data = await plugins.hooks.fire('filter:topics.updateRecent', {});

[NoCoverage] BlockStatement
src/topics/scheduled.js:15:35
-   Scheduled.startJobs = function () {
-       winston.verbose('[scheduled topics] Starting jobs.');
-       new CronJob('*/1 * * * *', Scheduled.handleExpired, null, true);
-   };
+   Scheduled.startJobs = function () {};

[NoCoverage] StringLiteral
src/topics/scheduled.js:16:21
-       winston.verbose('[scheduled topics] Starting jobs.');
+       winston.verbose("");

[NoCoverage] StringLiteral
src/topics/scheduled.js:17:17
-       new CronJob('*/1 * * * *', Scheduled.handleExpired, null, true);
+       new CronJob("", Scheduled.handleExpired, null, true);

[NoCoverage] BooleanLiteral
src/topics/scheduled.js:17:63
-       new CronJob('*/1 * * * *', Scheduled.handleExpired, null, true);
+       new CronJob('*/1 * * * *', Scheduled.handleExpired, null, false);

[NoCoverage] BlockStatement
src/topics/scheduled.js:24:23
-       if (!tids.length) {
-           return;
-       }
+       if (!tids.length) {}

[NoCoverage] StringLiteral
src/topics/sorted.js:22:38
-           params.sort = params.sort || 'recent';
+           params.sort = params.sort || "";

[NoCoverage] BlockStatement
src/topics/sorted.js:24:90
-           if (params.hasOwnProperty('cids') && params.cids && !Array.isArray(params.cids)) {
-               params.cids = [params.cids];
-           }
+           if (params.hasOwnProperty('cids') && params.cids && !Array.isArray(params.cids)) {}

[NoCoverage] ArrayDeclaration
src/topics/sorted.js:25:27
-               params.cids = [params.cids];
+               params.cids = [];

[NoCoverage] BlockStatement
src/topics/sorted.js:28:57
-           if (params.tags && !Array.isArray(params.tags)) {
-               params.tags = [params.tags];
-           }
+           if (params.tags && !Array.isArray(params.tags)) {}

[NoCoverage] ArrayDeclaration
src/topics/sorted.js:29:27
-               params.tags = [params.tags];
+               params.tags = [];

[NoCoverage] BlockStatement
src/topics/sorted.js:41:72
-           if (plugins.hooks.hasListeners('filter:topics.getSortedTids')) {
-               const result = await plugins.hooks.fire('filter:topics.getSortedTids', { params: params, tids: [] });
-               return result.tids;
-           }
+           if (plugins.hooks.hasListeners('filter:topics.getSortedTids')) {}

[NoCoverage] StringLiteral
src/topics/sorted.js:42:53
-               const result = await plugins.hooks.fire('filter:topics.getSortedTids', { params: params, tids: [] });
+               const result = await plugins.hooks.fire("", { params: params, tids: [] });

[NoCoverage] ObjectLiteral
src/topics/sorted.js:42:84
-               const result = await plugins.hooks.fire('filter:topics.getSortedTids', { params: params, tids: [] });
+               const result = await plugins.hooks.fire('filter:topics.getSortedTids', {});

[NoCoverage] ArrayDeclaration
src/topics/sorted.js:42:108
-               const result = await plugins.hooks.fire('filter:topics.getSortedTids', { params: params, tids: [] });
+               const result = await plugins.hooks.fire('filter:topics.getSortedTids', { params: params, tids: ["Stryker was here"] });

[NoCoverage] BlockStatement
src/topics/sorted.js:48:46
-               if (params.filter === 'watched') {
-                   tids = await Topics.filterWatchedTids(tids, params.uid);
-               }
+               if (params.filter === 'watched') {}

[NoCoverage] BlockStatement
src/topics/sorted.js:55:40
-           } else if (params.tags.length) {
-               tids = await getTagTids(params);
-           } else if (params.sort === 'old') {
+           } else if (params.tags.length) {} else if (params.sort === 'old') {

[NoCoverage] BlockStatement
src/topics/sorted.js:57:43
-           } else if (params.sort === 'old') {
-               tids = await db.getSortedSetRange(`topics:recent`, 0, meta.config.recentMaxTopics - 1);
-           } else {
+           } else if (params.sort === 'old') {} else {

[NoCoverage] StringLiteral
src/topics/sorted.js:58:47
-               tids = await db.getSortedSetRange(`topics:recent`, 0, meta.config.recentMaxTopics - 1);
+               tids = await db.getSortedSetRange(``, 0, meta.config.recentMaxTopics - 1);

[NoCoverage] ArithmeticOperator
src/topics/sorted.js:58:67
-               tids = await db.getSortedSetRange(`topics:recent`, 0, meta.config.recentMaxTopics - 1);
+               tids = await db.getSortedSetRange(`topics:recent`, 0, meta.config.recentMaxTopics + 1);

[NoCoverage] BlockStatement
src/topics/sorted.js:66:39
-       async function getTagTids(params) {
-           const sets = [
-               params.sort === 'old' ?
-                   'topics:recent' :
-                   `topics:${params.sort}`,
-               ...params.tags.map(tag => `tag:${tag}:topics`),
-           ];
-           const method = params.sort === 'old' ?
-               'getSortedSetIntersect' :
-               'getSortedSetRevIntersect';
-           return await db[method]({
-               sets: sets,
-               start: 0,
-               stop: meta.config.recentMaxTopics - 1,
-               weights: sets.map((s, index) => (index ? 0 : 1)),
-           });
-       }
+       async function getTagTids(params) {}

[NoCoverage] ArrayDeclaration
src/topics/sorted.js:67:22
-           const sets = [
-               params.sort === 'old' ?
-                   'topics:recent' :
-                   `topics:${params.sort}`,
-               ...params.tags.map(tag => `tag:${tag}:topics`),
-           ];
+           const sets = [];

[NoCoverage] ConditionalExpression
src/topics/sorted.js:68:13
-               params.sort === 'old' ?
+               true ?

[NoCoverage] ConditionalExpression
src/topics/sorted.js:68:13
-               params.sort === 'old' ?
+               false ?

[NoCoverage] EqualityOperator
src/topics/sorted.js:68:13
-               params.sort === 'old' ?
+               params.sort !== 'old' ?

[NoCoverage] StringLiteral
src/topics/sorted.js:68:29
-               params.sort === 'old' ?
+               params.sort === "" ?

[NoCoverage] StringLiteral
src/topics/sorted.js:69:17
-                   'topics:recent' :
+                   "" :

[NoCoverage] StringLiteral
src/topics/sorted.js:70:17
-                   `topics:${params.sort}`,
+                   ``,

[NoCoverage] ArrowFunction
src/topics/sorted.js:71:32
-               ...params.tags.map(tag => `tag:${tag}:topics`),
+               ...params.tags.map(() => undefined),

[NoCoverage] StringLiteral
src/topics/sorted.js:71:39
-               ...params.tags.map(tag => `tag:${tag}:topics`),
+               ...params.tags.map(tag => ``),

[NoCoverage] ConditionalExpression
src/topics/sorted.js:73:24
-           const method = params.sort === 'old' ?
+           const method = true ?

[NoCoverage] ConditionalExpression
src/topics/sorted.js:73:24
-           const method = params.sort === 'old' ?
+           const method = false ?

[NoCoverage] EqualityOperator
src/topics/sorted.js:73:24
-           const method = params.sort === 'old' ?
+           const method = params.sort !== 'old' ?

[NoCoverage] StringLiteral
src/topics/sorted.js:73:40
-           const method = params.sort === 'old' ?
+           const method = params.sort === "" ?

[NoCoverage] StringLiteral
src/topics/sorted.js:74:13
-               'getSortedSetIntersect' :
+               "" :

[NoCoverage] StringLiteral
src/topics/sorted.js:75:13
-               'getSortedSetRevIntersect';
+               "";

[NoCoverage] ObjectLiteral
src/topics/sorted.js:76:33
-           return await db[method]({
-               sets: sets,
-               start: 0,
-               stop: meta.config.recentMaxTopics - 1,
-               weights: sets.map((s, index) => (index ? 0 : 1)),
-           });
+           return await db[method]({});

[NoCoverage] ArithmeticOperator
src/topics/sorted.js:79:19
-               stop: meta.config.recentMaxTopics - 1,
+               stop: meta.config.recentMaxTopics + 1,

[NoCoverage] ArrowFunction
src/topics/sorted.js:80:31
-               weights: sets.map((s, index) => (index ? 0 : 1)),
+               weights: sets.map(() => undefined),

[NoCoverage] BlockStatement
src/topics/sorted.js:85:33
-           if (params.tags.length) {
-               return _.intersection(...await Promise.all(params.tags.map(async (tag) => {
-                   const sets = params.cids.map(cid => `cid:${cid}:tag:${tag}:topics`);
-                   return await db.getSortedSetRevRange(sets, 0, -1);
-               })));
-           }
+           if (params.tags.length) {}

[NoCoverage] BlockStatement
src/topics/sorted.js:86:87
-               return _.intersection(...await Promise.all(params.tags.map(async (tag) => {
-                   const sets = params.cids.map(cid => `cid:${cid}:tag:${tag}:topics`);
-                   return await db.getSortedSetRevRange(sets, 0, -1);
-               })));
+               return _.intersection(...await Promise.all(params.tags.map(async (tag) => {})));

[NoCoverage] ArrowFunction
src/topics/sorted.js:87:46
-                   const sets = params.cids.map(cid => `cid:${cid}:tag:${tag}:topics`);
+                   const sets = params.cids.map(() => undefined);

[NoCoverage] StringLiteral
src/topics/sorted.js:87:53
-                   const sets = params.cids.map(cid => `cid:${cid}:tag:${tag}:topics`);
+                   const sets = params.cids.map(cid => ``);

[NoCoverage] UnaryOperator
src/topics/sorted.js:88:63
-                   return await db.getSortedSetRevRange(sets, 0, -1);
+                   return await db.getSortedSetRevRange(sets, 0, +1);

[NoCoverage] StringLiteral
src/topics/sorted.js:98:79
-                   sets.push(`cid:${cid}:tids${params.sort ? `:${params.sort}` : ''}`);
+                   sets.push(`cid:${cid}:tids${params.sort ? `:${params.sort}` : "Stryker was here!"}`);

[NoCoverage] BlockStatement
src/topics/sorted.js:125:33
-           if (params.floatPinned) {
-               floatPinned(topicData, sortFn);
-           } else {
+           if (params.floatPinned) {} else {

[NoCoverage] BlockStatement
src/topics/sorted.js:134:45
-       function floatPinned(topicData, sortFn) {
-           topicData.sort((a, b) => (a.pinned !== b.pinned ? b.pinned - a.pinned : sortFn(a, b)));
-       }
+       function floatPinned(topicData, sortFn) {}

[NoCoverage] MethodExpression
src/topics/sorted.js:135:9
-           topicData.sort((a, b) => (a.pinned !== b.pinned ? b.pinned - a.pinned : sortFn(a, b)));
+           topicData;

[NoCoverage] ArrowFunction
src/topics/sorted.js:135:24
-           topicData.sort((a, b) => (a.pinned !== b.pinned ? b.pinned - a.pinned : sortFn(a, b)));
+           topicData.sort(() => undefined);

[NoCoverage] ConditionalExpression
src/topics/sorted.js:135:35
-           topicData.sort((a, b) => (a.pinned !== b.pinned ? b.pinned - a.pinned : sortFn(a, b)));
+           topicData.sort((a, b) => (true ? b.pinned - a.pinned : sortFn(a, b)));

[NoCoverage] ConditionalExpression
src/topics/sorted.js:135:35
-           topicData.sort((a, b) => (a.pinned !== b.pinned ? b.pinned - a.pinned : sortFn(a, b)));
+           topicData.sort((a, b) => (false ? b.pinned - a.pinned : sortFn(a, b)));

[NoCoverage] EqualityOperator
src/topics/sorted.js:135:35
-           topicData.sort((a, b) => (a.pinned !== b.pinned ? b.pinned - a.pinned : sortFn(a, b)));
+           topicData.sort((a, b) => (a.pinned === b.pinned ? b.pinned - a.pinned : sortFn(a, b)));

[NoCoverage] ArithmeticOperator
src/topics/sorted.js:135:59
-           topicData.sort((a, b) => (a.pinned !== b.pinned ? b.pinned - a.pinned : sortFn(a, b)));
+           topicData.sort((a, b) => (a.pinned !== b.pinned ? b.pinned + a.pinned : sortFn(a, b)));

[NoCoverage] BlockStatement
src/topics/sorted.js:153:32
-       function sortPopular(a, b) {
-           if (a.postcount !== b.postcount) {
-               return b.postcount - a.postcount;
-           }
-           return b.viewcount - a.viewcount;
-       }
+       function sortPopular(a, b) {}

[NoCoverage] ConditionalExpression
src/topics/sorted.js:154:13
-           if (a.postcount !== b.postcount) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/topics/sorted.js:154:13
-           if (a.postcount !== b.postcount) {
+           if (false) {

[NoCoverage] EqualityOperator
src/topics/sorted.js:154:13
-           if (a.postcount !== b.postcount) {
+           if (a.postcount === b.postcount) {

[NoCoverage] BlockStatement
src/topics/sorted.js:154:42
-           if (a.postcount !== b.postcount) {
-               return b.postcount - a.postcount;
-           }
+           if (a.postcount !== b.postcount) {}

[NoCoverage] ArithmeticOperator
src/topics/sorted.js:155:20
-               return b.postcount - a.postcount;
+               return b.postcount + a.postcount;

[NoCoverage] ArithmeticOperator
src/topics/sorted.js:157:16
-           return b.viewcount - a.viewcount;
+           return b.viewcount + a.viewcount;

[NoCoverage] BlockStatement
src/topics/sorted.js:160:30
-       function sortViews(a, b) {
-           return b.viewcount - a.viewcount;
-       }
+       function sortViews(a, b) {}

[NoCoverage] ArithmeticOperator
src/topics/sorted.js:161:16
-           return b.viewcount - a.viewcount;
+           return b.viewcount + a.viewcount;

[NoCoverage] ArithmeticOperator
src/topics/suggested.js:15:43
-           cutoff = cutoff === 0 ? cutoff : (cutoff * 2592000000);
+           cutoff = cutoff === 0 ? cutoff : (cutoff / 2592000000);

[NoCoverage] ArrowFunction
src/topics/suggested.js:42:59
-               await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() - cutoff);
+               await db.getSortedSetRevRangeByScore(tags.map(() => undefined), 0, -1, '+inf', Date.now() - cutoff);

[NoCoverage] StringLiteral
src/topics/suggested.js:42:66
-               await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() - cutoff);
+               await db.getSortedSetRevRangeByScore(tags.map(tag => ``), 0, -1, '+inf', Date.now() - cutoff);

[NoCoverage] UnaryOperator
src/topics/suggested.js:42:91
-               await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() - cutoff);
+               await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, +1, '+inf', Date.now() - cutoff);

[NoCoverage] StringLiteral
src/topics/suggested.js:42:95
-               await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() - cutoff);
+               await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, "", Date.now() - cutoff);

[NoCoverage] ArithmeticOperator
src/topics/suggested.js:42:103
-               await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() - cutoff);
+               await db.getSortedSetRevRangeByScore(tags.map(tag => `tag:${tag}:topics`), 0, -1, '+inf', Date.now() + cutoff);

[NoCoverage] ArithmeticOperator
src/topics/suggested.js:56:39
-               timeRange: cutoff !== 0 ? cutoff / 1000 : 0,
+               timeRange: cutoff !== 0 ? cutoff * 1000 : 0,

[NoCoverage] ConditionalExpression
src/topics/suggested.js:59:46
-           data.tids = data.tids.filter(_tid => _tid !== tid); // remove self
+           data.tids = data.tids.filter(_tid => true); // remove self

[NoCoverage] ConditionalExpression
src/topics/suggested.js:59:46
-           data.tids = data.tids.filter(_tid => _tid !== tid); // remove self
+           data.tids = data.tids.filter(_tid => false); // remove self

[NoCoverage] EqualityOperator
src/topics/suggested.js:59:46
-           data.tids = data.tids.filter(_tid => _tid !== tid); // remove self
+           data.tids = data.tids.filter(_tid => _tid === tid); // remove self

[NoCoverage] StringLiteral
src/topics/suggested.js:67:50
-               await db.getSortedSetRevRangeByScore(`cid:${cid}:tids:lastposttime`, 0, 9, '+inf', Date.now() - cutoff);
+               await db.getSortedSetRevRangeByScore(``, 0, 9, '+inf', Date.now() - cutoff);

[NoCoverage] StringLiteral
src/topics/suggested.js:67:88
-               await db.getSortedSetRevRangeByScore(`cid:${cid}:tids:lastposttime`, 0, 9, '+inf', Date.now() - cutoff);
+               await db.getSortedSetRevRangeByScore(`cid:${cid}:tids:lastposttime`, 0, 9, "", Date.now() - cutoff);

[NoCoverage] ArithmeticOperator
src/topics/suggested.js:67:96
-               await db.getSortedSetRevRangeByScore(`cid:${cid}:tids:lastposttime`, 0, 9, '+inf', Date.now() - cutoff);
+               await db.getSortedSetRevRangeByScore(`cid:${cid}:tids:lastposttime`, 0, 9, '+inf', Date.now() + cutoff);

[NoCoverage] BlockStatement
src/topics/tags.js:67:35
-           if (!Array.isArray(tags)) {
-               throw new Error('[[error:invalid-data]]');
-           }
+           if (!Array.isArray(tags)) {}

[NoCoverage] StringLiteral
src/topics/tags.js:68:29
-               throw new Error('[[error:invalid-data]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/tags.js:92:86
-               removedTags.length && removedTags.some(tag => systemTags.includes(tag))) {
-               throw new Error('[[error:cant-remove-system-tag]]');
-           }
+               removedTags.length && removedTags.some(tag => systemTags.includes(tag))) {}

[NoCoverage] StringLiteral
src/topics/tags.js:93:29
-               throw new Error('[[error:cant-remove-system-tag]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/tags.js:135:48
-           if (!newTagName || tag === newTagName) {
-               return;
-           }
+           if (!newTagName || tag === newTagName) {}

[NoCoverage] BlockStatement
src/topics/tags.js:187:71
-       Topics.getTagTidsByCids = async function (tag, cids, start, stop) {
-           const keys = cids.map(cid => `cid:${cid}:tag:${tag}:topics`);
-           const tids = await db.getSortedSetRevRange(keys, start, stop);
-           const payload = await plugins.hooks.fire('filter:topics.getTagTidsByCids', { tag, cids, start, stop, tids });
-           return payload.tids;
-       };
+       Topics.getTagTidsByCids = async function (tag, cids, start, stop) {};

[NoCoverage] ArrowFunction
src/topics/tags.js:188:31
-           const keys = cids.map(cid => `cid:${cid}:tag:${tag}:topics`);
+           const keys = cids.map(() => undefined);

[NoCoverage] StringLiteral
src/topics/tags.js:188:38
-           const keys = cids.map(cid => `cid:${cid}:tag:${tag}:topics`);
+           const keys = cids.map(cid => ``);

[NoCoverage] StringLiteral
src/topics/tags.js:190:50
-           const payload = await plugins.hooks.fire('filter:topics.getTagTidsByCids', { tag, cids, start, stop, tids });
+           const payload = await plugins.hooks.fire("", { tag, cids, start, stop, tids });

[NoCoverage] ObjectLiteral
src/topics/tags.js:190:84
-           const payload = await plugins.hooks.fire('filter:topics.getTagTidsByCids', { tag, cids, start, stop, tids });
+           const payload = await plugins.hooks.fire('filter:topics.getTagTidsByCids', {});

[NoCoverage] BlockStatement
src/topics/tags.js:196:26
-           if (cids.length) {
-               count = await db.sortedSetsCardSum(
-                   cids.map(cid => `cid:${cid}:tag:${tag}:topics`)
-               );
-           } else {
+           if (cids.length) {} else {

[NoCoverage] ArrowFunction
src/topics/tags.js:198:26
-                   cids.map(cid => `cid:${cid}:tag:${tag}:topics`)
+                   cids.map(() => undefined)

[NoCoverage] StringLiteral
src/topics/tags.js:198:33
-                   cids.map(cid => `cid:${cid}:tag:${tag}:topics`)
+                   cids.map(cid => ``)

[NoCoverage] BlockStatement
src/topics/tags.js:254:34
-           if (Array.isArray(cids)) {
-               return await db.getSortedSetRevUnion({
-                   sets: cids.map(cid => `cid:${cid}:tags`),
-                   start,
-                   stop,
-               });
-           }
+           if (Array.isArray(cids)) {}

[NoCoverage] ObjectLiteral
src/topics/tags.js:255:50
-               return await db.getSortedSetRevUnion({
-                   sets: cids.map(cid => `cid:${cid}:tags`),
-                   start,
-                   stop,
-               });
+               return await db.getSortedSetRevUnion({});

[NoCoverage] ArrowFunction
src/topics/tags.js:256:32
-                   sets: cids.map(cid => `cid:${cid}:tags`),
+                   sets: cids.map(() => undefined),

[NoCoverage] StringLiteral
src/topics/tags.js:256:39
-                   sets: cids.map(cid => `cid:${cid}:tags`),
+                   sets: cids.map(cid => ``),

[NoCoverage] ArrayDeclaration
src/topics/tags.js:315:63
-           return Array.isArray(data) && data.length ? data[0] : [];
+           return Array.isArray(data) && data.length ? data[0] : ["Stryker was here"];

[NoCoverage] BlockStatement
src/topics/tags.js:411:69
-           if (plugins.hooks.hasListeners('filter:topics.searchTags')) {
-               result = await plugins.hooks.fire('filter:topics.searchTags', { data: data });
-           } else {
+           if (plugins.hooks.hasListeners('filter:topics.searchTags')) {} else {

[NoCoverage] StringLiteral
src/topics/tags.js:412:47
-               result = await plugins.hooks.fire('filter:topics.searchTags', { data: data });
+               result = await plugins.hooks.fire("", { data: data });

[NoCoverage] ObjectLiteral
src/topics/tags.js:412:75
-               result = await plugins.hooks.fire('filter:topics.searchTags', { data: data });
+               result = await plugins.hooks.fire('filter:topics.searchTags', {});

[NoCoverage] BlockStatement
src/topics/tags.js:425:75
-           if (plugins.hooks.hasListeners('filter:topics.autocompleteTags')) {
-               result = await plugins.hooks.fire('filter:topics.autocompleteTags', { data: data });
-           } else {
+           if (plugins.hooks.hasListeners('filter:topics.autocompleteTags')) {} else {

[NoCoverage] StringLiteral
src/topics/tags.js:426:47
-               result = await plugins.hooks.fire('filter:topics.autocompleteTags', { data: data });
+               result = await plugins.hooks.fire("", { data: data });

[NoCoverage] ObjectLiteral
src/topics/tags.js:426:81
-               result = await plugins.hooks.fire('filter:topics.autocompleteTags', { data: data });
+               result = await plugins.hooks.fire('filter:topics.autocompleteTags', {});

[NoCoverage] BlockStatement
src/topics/tags.js:433:33
-       async function getAllTags() {
-           const cached = cache.get('tags:topic:count');
-           if (cached !== undefined) {
-               return cached;
-           }
-           const tags = await db.getSortedSetRevRangeWithScores('tags:topic:count', 0, -1);
-           cache.set('tags:topic:count', tags);
-           return tags;
-       }
+       async function getAllTags() {}

[NoCoverage] StringLiteral
src/topics/tags.js:434:34
-           const cached = cache.get('tags:topic:count');
+           const cached = cache.get("");

[NoCoverage] ConditionalExpression
src/topics/tags.js:435:13
-           if (cached !== undefined) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/topics/tags.js:435:13
-           if (cached !== undefined) {
+           if (false) {

[NoCoverage] EqualityOperator
src/topics/tags.js:435:13
-           if (cached !== undefined) {
+           if (cached === undefined) {

[NoCoverage] BlockStatement
src/topics/tags.js:435:35
-           if (cached !== undefined) {
-               return cached;
-           }
+           if (cached !== undefined) {}

[NoCoverage] StringLiteral
src/topics/tags.js:438:62
-           const tags = await db.getSortedSetRevRangeWithScores('tags:topic:count', 0, -1);
+           const tags = await db.getSortedSetRevRangeWithScores("", 0, -1);

[NoCoverage] UnaryOperator
src/topics/tags.js:438:85
-           const tags = await db.getSortedSetRevRangeWithScores('tags:topic:count', 0, -1);
+           const tags = await db.getSortedSetRevRangeWithScores('tags:topic:count', 0, +1);
