[NoCoverage] StringLiteral
src/topics/tags.js:439:19
-           cache.set('tags:topic:count', tags);
+           cache.set("", tags);

[NoCoverage] BlockStatement
src/topics/tags.js:446:37
-           if (parseInt(data.cid, 10)) {
-               tagWhitelist = await categories.getTagWhitelist([data.cid]);
-           }
+           if (parseInt(data.cid, 10)) {}

[NoCoverage] ArrayDeclaration
src/topics/tags.js:447:61
-               tagWhitelist = await categories.getTagWhitelist([data.cid]);
+               tagWhitelist = await categories.getTagWhitelist([]);

[NoCoverage] BlockStatement
src/topics/tags.js:450:71
-           if (Array.isArray(tagWhitelist[0]) && tagWhitelist[0].length) {
-               const scores = await db.sortedSetScores(`cid:${data.cid}:tags`, tagWhitelist[0]);
-               tags = tagWhitelist[0].map((tag, index) => ({ value: tag, score: scores[index] }));
-           } else if (data.cids) {
+           if (Array.isArray(tagWhitelist[0]) && tagWhitelist[0].length) {} else if (data.cids) {

[NoCoverage] StringLiteral
src/topics/tags.js:451:53
-               const scores = await db.sortedSetScores(`cid:${data.cid}:tags`, tagWhitelist[0]);
+               const scores = await db.sortedSetScores(``, tagWhitelist[0]);

[NoCoverage] ArrowFunction
src/topics/tags.js:452:40
-               tags = tagWhitelist[0].map((tag, index) => ({ value: tag, score: scores[index] }));
+               tags = tagWhitelist[0].map(() => undefined);

[NoCoverage] ObjectLiteral
src/topics/tags.js:452:57
-               tags = tagWhitelist[0].map((tag, index) => ({ value: tag, score: scores[index] }));
+               tags = tagWhitelist[0].map((tag, index) => ({}));

[NoCoverage] BlockStatement
src/topics/tags.js:460:16
-           } else {
-               tags = await getAllTags();
-           }
+           } else {}

[NoCoverage] BlockStatement
src/topics/tags.js:470:42
-                   if (matches.length > 39) {
-                       break;
-                   }
+                   if (matches.length > 39) {}

[NoCoverage] BlockStatement
src/topics/tags.js:512:74
-           if (plugins.hooks.hasListeners('filter:topic.getRelatedTopics')) {
-               const result = await plugins.hooks.fire('filter:topic.getRelatedTopics', { topic: topicData, uid: uid, topics: [] });
-               return result.topics;
-           }
+           if (plugins.hooks.hasListeners('filter:topic.getRelatedTopics')) {}

[NoCoverage] StringLiteral
src/topics/tags.js:513:53
-               const result = await plugins.hooks.fire('filter:topic.getRelatedTopics', { topic: topicData, uid: uid, topics: [] });
+               const result = await plugins.hooks.fire("", { topic: topicData, uid: uid, topics: [] });

[NoCoverage] ObjectLiteral
src/topics/tags.js:513:86
-               const result = await plugins.hooks.fire('filter:topic.getRelatedTopics', { topic: topicData, uid: uid, topics: [] });
+               const result = await plugins.hooks.fire('filter:topic.getRelatedTopics', {});

[NoCoverage] ArrayDeclaration
src/topics/tags.js:513:124
-               const result = await plugins.hooks.fire('filter:topic.getRelatedTopics', { topic: topicData, uid: uid, topics: [] });
+               const result = await plugins.hooks.fire('filter:topic.getRelatedTopics', { topic: topicData, uid: uid, topics: ["Stryker was here"] });

[NoCoverage] BlockStatement
src/topics/teaser.js:32:49
-                   if (topic.teaserPid === 'null') {
-                       delete topic.teaserPid;
-                   }
+                   if (topic.teaserPid === 'null') {}

[NoCoverage] BlockStatement
src/topics/teaser.js:99:27
-           if (sortNewToOld) {
-               return Math.min(2, postCountInTopic);
-           }
+           if (sortNewToOld) {}

[NoCoverage] MethodExpression
src/topics/teaser.js:100:20
-               return Math.min(2, postCountInTopic);
+               return Math.max(2, postCountInTopic);

[NoCoverage] StringLiteral
src/topics/thumbs.js:20:30
-       const set = `${isDraft ? 'draft' : 'topic'}:${id}:thumbs`;
+       const set = `${isDraft ? "" : 'topic'}:${id}:thumbs`;

[NoCoverage] ArrayDeclaration
src/topics/thumbs.js:30:74
-       return topicData.map(t => (t && t.tid ? (tidToThumbs[t.tid] || []) : []));
+       return topicData.map(t => (t && t.tid ? (tidToThumbs[t.tid] || []) : ["Stryker was here"]));

[NoCoverage] ArrayDeclaration
src/topics/thumbs.js:42:27
-           return singular ? [] : tids.map(() => []);
+           return singular ? ["Stryker was here"] : tids.map(() => []);

[NoCoverage] ArrayDeclaration
src/topics/thumbs.js:42:47
-           return singular ? [] : tids.map(() => []);
+           return singular ? [] : tids.map(() => ["Stryker was here"]);

[NoCoverage] StringLiteral
src/topics/thumbs.js:47:69
-       const sets = tids.map(tid => `${validator.isUUID(String(tid)) ? 'draft' : 'topic'}:${tid}:thumbs`);
+       const sets = tids.map(tid => `${validator.isUUID(String(tid)) ? "" : 'topic'}:${tid}:thumbs`);

[NoCoverage] BlockStatement
src/topics/thumbs.js:117:47
-       } else if (!Array.isArray(relativePaths)) {
-           throw new Error('[[error:invalid-data]]');
-       }
+       } else if (!Array.isArray(relativePaths)) {}

[NoCoverage] StringLiteral
src/topics/thumbs.js:118:25
-           throw new Error('[[error:invalid-data]]');
+           throw new Error("");

[NoCoverage] StringLiteral
src/topics/thumbs.js:158:30
-       const set = `${isDraft ? 'draft' : 'topic'}:${id}:thumbs`;
+       const set = `${isDraft ? "" : 'topic'}:${id}:thumbs`;

[Survived] ObjectLiteral
src/topics/thumbs.js:102:72
-       await Promise.all(thumbs.map(async thumb => await Thumbs.associate({
-           id,
-           path: thumb.value,
-           score: thumb.score,
-       })));
+       await Promise.all(thumbs.map(async thumb => await Thumbs.associate({})));
Tests ran:
    Topic thumbs .associate() should combine the thumbs uploaded to a UUID zset and combine it with a topic's thumb zset

[Survived] StringLiteral
src/topics/thumbs.js:113:30
-       const set = `${isDraft ? 'draft' : 'topic'}:${id}:thumbs`;
+       const set = `${isDraft ? "" : 'topic'}:${id}:thumbs`;
Tests ran:
    Topic thumbs .delete() should also work with UUIDs
    Topic thumbs .delete() should also work with URLs
    Topic thumbs .delete() should not delete the file from disk if not associated with the tid

[Survived] ArrowFunction
src/topics/thumbs.js:142:40
-           await Promise.all(toDelete.map(async absolutePath => file.delete(absolutePath)));
+           await Promise.all(toDelete.map(() => undefined));
Tests ran:
    Topic thumbs .delete() should also work with UUIDs

[NoCoverage] BlockStatement
src/topics/tools.js:28:25
-           if (!topicData) {
-               throw new Error('[[error:no-topic]]');
-           }
+           if (!topicData) {}

[NoCoverage] StringLiteral
src/topics/tools.js:29:29
-               throw new Error('[[error:no-topic]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/tools.js:43:54
-           if (data.topicData.deleted && data.isDelete) {
-               throw new Error('[[error:topic-already-deleted]]');
-           } else if (!data.topicData.deleted && !data.isDelete) {
+           if (data.topicData.deleted && data.isDelete) {} else if (!data.topicData.deleted && !data.isDelete) {

[NoCoverage] StringLiteral
src/topics/tools.js:44:29
-               throw new Error('[[error:topic-already-deleted]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/tools.js:45:63
-           } else if (!data.topicData.deleted && !data.isDelete) {
-               throw new Error('[[error:topic-already-restored]]');
-           }
+           } else if (!data.topicData.deleted && !data.isDelete) {}

[NoCoverage] StringLiteral
src/topics/tools.js:46:29
-               throw new Error('[[error:topic-already-restored]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/tools.js:75:25
-           if (!topicData) {
-               throw new Error('[[error:no-topic]]');
-           }
+           if (!topicData) {}

[NoCoverage] StringLiteral
src/topics/tools.js:76:29
-               throw new Error('[[error:no-topic]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/tools.js:97:43
-           if (!topicData || !topicData.cid) {
-               throw new Error('[[error:no-topic]]');
-           }
+           if (!topicData || !topicData.cid) {}

[NoCoverage] StringLiteral
src/topics/tools.js:98:29
-               throw new Error('[[error:no-topic]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/tools.js:101:28
-           if (!isAdminOrMod) {
-               throw new Error('[[error:no-privileges]]');
-           }
+           if (!isAdminOrMod) {}

[NoCoverage] StringLiteral
src/topics/tools.js:102:29
-               throw new Error('[[error:no-privileges]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/tools.js:121:59
-       topicTools.setPinExpiry = async (tid, expiry, uid) => {
-           if (isNaN(parseInt(expiry, 10)) || expiry <= Date.now()) {
-               throw new Error('[[error:invalid-data]]');
-           }
-           const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', 'cid']);
-           const isAdminOrMod = await privileges.categories.isAdminOrMod(topicData.cid, uid);
-           if (!isAdminOrMod) {
-               throw new Error('[[error:no-privileges]]');
-           }
-           await Topics.setTopicField(tid, 'pinExpiry', expiry);
-           plugins.hooks.fire('action:topic.setPinExpiry', { topic: _.clone(topicData), uid: uid });
-       };
+       topicTools.setPinExpiry = async (tid, expiry, uid) => {};

[NoCoverage] ConditionalExpression
src/topics/tools.js:122:13
-           if (isNaN(parseInt(expiry, 10)) || expiry <= Date.now()) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/topics/tools.js:122:13
-           if (isNaN(parseInt(expiry, 10)) || expiry <= Date.now()) {
+           if (false) {

[NoCoverage] LogicalOperator
src/topics/tools.js:122:13
-           if (isNaN(parseInt(expiry, 10)) || expiry <= Date.now()) {
+           if (isNaN(parseInt(expiry, 10)) && expiry <= Date.now()) {

[NoCoverage] ConditionalExpression
src/topics/tools.js:122:44
-           if (isNaN(parseInt(expiry, 10)) || expiry <= Date.now()) {
+           if (isNaN(parseInt(expiry, 10)) || false) {

[NoCoverage] EqualityOperator
src/topics/tools.js:122:44
-           if (isNaN(parseInt(expiry, 10)) || expiry <= Date.now()) {
+           if (isNaN(parseInt(expiry, 10)) || expiry < Date.now()) {

[NoCoverage] EqualityOperator
src/topics/tools.js:122:44
-           if (isNaN(parseInt(expiry, 10)) || expiry <= Date.now()) {
+           if (isNaN(parseInt(expiry, 10)) || expiry > Date.now()) {

[NoCoverage] BlockStatement
src/topics/tools.js:122:66
-           if (isNaN(parseInt(expiry, 10)) || expiry <= Date.now()) {
-               throw new Error('[[error:invalid-data]]');
-           }
+           if (isNaN(parseInt(expiry, 10)) || expiry <= Date.now()) {}

[NoCoverage] StringLiteral
src/topics/tools.js:123:29
-               throw new Error('[[error:invalid-data]]');
+               throw new Error("");

[NoCoverage] ArrayDeclaration
src/topics/tools.js:126:60
-           const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', 'cid']);
+           const topicData = await Topics.getTopicFields(tid, []);

[NoCoverage] StringLiteral
src/topics/tools.js:126:61
-           const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', 'cid']);
+           const topicData = await Topics.getTopicFields(tid, ["", 'uid', 'cid']);

[NoCoverage] StringLiteral
src/topics/tools.js:126:68
-           const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', 'cid']);
+           const topicData = await Topics.getTopicFields(tid, ['tid', "", 'cid']);

[NoCoverage] StringLiteral
src/topics/tools.js:126:75
-           const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', 'cid']);
+           const topicData = await Topics.getTopicFields(tid, ['tid', 'uid', ""]);

[NoCoverage] BooleanLiteral
src/topics/tools.js:128:13
-           if (!isAdminOrMod) {
+           if (isAdminOrMod) {

[NoCoverage] ConditionalExpression
src/topics/tools.js:128:13
-           if (!isAdminOrMod) {
+           if (true) {

[NoCoverage] ConditionalExpression
src/topics/tools.js:128:13
-           if (!isAdminOrMod) {
+           if (false) {

[NoCoverage] BlockStatement
src/topics/tools.js:128:28
-           if (!isAdminOrMod) {
-               throw new Error('[[error:no-privileges]]');
-           }
+           if (!isAdminOrMod) {}

[NoCoverage] StringLiteral
src/topics/tools.js:129:29
-               throw new Error('[[error:no-privileges]]');
+               throw new Error("");

[NoCoverage] StringLiteral
src/topics/tools.js:132:41
-           await Topics.setTopicField(tid, 'pinExpiry', expiry);
+           await Topics.setTopicField(tid, "", expiry);

[NoCoverage] StringLiteral
src/topics/tools.js:133:28
-           plugins.hooks.fire('action:topic.setPinExpiry', { topic: _.clone(topicData), uid: uid });
+           plugins.hooks.fire("", { topic: _.clone(topicData), uid: uid });

[NoCoverage] ObjectLiteral
src/topics/tools.js:133:57
-           plugins.hooks.fire('action:topic.setPinExpiry', { topic: _.clone(topicData), uid: uid });
+           plugins.hooks.fire('action:topic.setPinExpiry', {});

[NoCoverage] ConditionalExpression
src/topics/tools.js:141:32
-               if (expiry[idx] && parseInt(expiry[idx], 10) <= now) {
+               if (expiry[idx] && true) {

[NoCoverage] EqualityOperator
src/topics/tools.js:141:32
-               if (expiry[idx] && parseInt(expiry[idx], 10) <= now) {
+               if (expiry[idx] && parseInt(expiry[idx], 10) < now) {

[NoCoverage] EqualityOperator
src/topics/tools.js:141:32
-               if (expiry[idx] && parseInt(expiry[idx], 10) <= now) {
+               if (expiry[idx] && parseInt(expiry[idx], 10) > now) {

[NoCoverage] BlockStatement
src/topics/tools.js:141:66
-               if (expiry[idx] && parseInt(expiry[idx], 10) <= now) {
-                   await togglePin(tid, 'system', false);
-                   return null;
-               }
+               if (expiry[idx] && parseInt(expiry[idx], 10) <= now) {}

[NoCoverage] StringLiteral
src/topics/tools.js:142:38
-                   await togglePin(tid, 'system', false);
+                   await togglePin(tid, "", false);

[NoCoverage] BooleanLiteral
src/topics/tools.js:142:48
-                   await togglePin(tid, 'system', false);
+                   await togglePin(tid, 'system', true);

[NoCoverage] BlockStatement
src/topics/tools.js:154:25
-           if (!topicData) {
-               throw new Error('[[error:no-topic]]');
-           }
+           if (!topicData) {}

[NoCoverage] StringLiteral
src/topics/tools.js:155:29
-               throw new Error('[[error:no-topic]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/tools.js:162:82
-           if (uid !== 'system' && !await privileges.topics.isAdminOrMod(tid, uid)) {
-               throw new Error('[[error:no-privileges]]');
-           }
+           if (uid !== 'system' && !await privileges.topics.isAdminOrMod(tid, uid)) {}

[NoCoverage] StringLiteral
src/topics/tools.js:163:29
-               throw new Error('[[error:no-privileges]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/tools.js:206:66
-           if (!cid || !tid || !utils.isNumber(order) || order < 0) {
-               throw new Error('[[error:invalid-data]]');
-           }
+           if (!cid || !tid || !utils.isNumber(order) || order < 0) {}

[NoCoverage] StringLiteral
src/topics/tools.js:207:29
-               throw new Error('[[error:invalid-data]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/tools.js:236:25
-           if (!topicData) {
-               throw new Error('[[error:no-topic]]');
-           }
+           if (!topicData) {}

[NoCoverage] StringLiteral
src/topics/tools.js:237:29
-               throw new Error('[[error:no-topic]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/tools.js:239:36
-           if (cid === topicData.cid) {
-               throw new Error('[[error:cant-move-topic-to-same-category]]');
-           }
+           if (cid === topicData.cid) {}

[NoCoverage] StringLiteral
src/topics/tools.js:240:29
-               throw new Error('[[error:cant-move-topic-to-same-category]]');
+               throw new Error("");

[NoCoverage] BlockStatement
src/topics/tools.js:263:31
-           if (topicData.pinned) {
-               bulk.push([`cid:${cid}:tids:pinned`, Date.now(), tid]);
-           } else {
+           if (topicData.pinned) {} else {

[NoCoverage] ArrayDeclaration
src/topics/tools.js:264:23
-               bulk.push([`cid:${cid}:tids:pinned`, Date.now(), tid]);
+               bulk.push([]);

[NoCoverage] StringLiteral
src/topics/tools.js:264:24
-               bulk.push([`cid:${cid}:tids:pinned`, Date.now(), tid]);
+               bulk.push([``, Date.now(), tid]);

[NoCoverage] BlockStatement
src/topics/unread.js:33:27
-           if (!tids.length) {
-               return unreadTopics;
-           }
+           if (!tids.length) {}

[NoCoverage] ArithmeticOperator
src/topics/unread.js:37:62
-           tids = tids.slice(params.start, params.stop !== -1 ? params.stop + 1 : undefined);
+           tids = tids.slice(params.start, params.stop !== -1 ? params.stop - 1 : undefined);

[NoCoverage] BlockStatement
src/topics/unread.js:40:32
-           if (!topicData.length) {
-               return unreadTopics;
-           }
+           if (!topicData.length) {}

[NoCoverage] BlockStatement
src/topics/unread.js:182:81
-           if (plugins.hooks.hasListeners('filter:topics.unread.getCategoryTids')) {
-               const result = await plugins.hooks.fire('filter:topics.unread.getCategoryTids', { params: params, tids: [] });
-               return result.tids;
-           }
+           if (plugins.hooks.hasListeners('filter:topics.unread.getCategoryTids')) {}

[NoCoverage] StringLiteral
src/topics/unread.js:183:53
-               const result = await plugins.hooks.fire('filter:topics.unread.getCategoryTids', { params: params, tids: [] });
+               const result = await plugins.hooks.fire("", { params: params, tids: [] });

[NoCoverage] ObjectLiteral
src/topics/unread.js:183:93
-               const result = await plugins.hooks.fire('filter:topics.unread.getCategoryTids', { params: params, tids: [] });
+               const result = await plugins.hooks.fire('filter:topics.unread.getCategoryTids', {});

[NoCoverage] ArrayDeclaration
src/topics/unread.js:183:117
-               const result = await plugins.hooks.fire('filter:topics.unread.getCategoryTids', { params: params, tids: [] });
+               const result = await plugins.hooks.fire('filter:topics.unread.getCategoryTids', { params: params, tids: ["Stryker was here"] });

[NoCoverage] BlockStatement
src/topics/unread.js:186:42
-           if (params.filter === 'watched') {
-               return [];
-           }
+           if (params.filter === 'watched') {}

[NoCoverage] ArrayDeclaration
src/topics/unread.js:187:20
-               return [];
+               return ["Stryker was here"];

[NoCoverage] BlockStatement
src/topics/unread.js:252:45
-           if (!uid || parseInt(uid, 10) <= 0) {
-               return;
-           }
+           if (!uid || parseInt(uid, 10) <= 0) {}

[NoCoverage] BlockStatement
src/topics/unread.js:275:27
-           if (!tids.length) {
-               return false;
-           }
+           if (!tids.length) {}

[NoCoverage] BooleanLiteral
src/topics/unread.js:276:20
-               return false;
+               return true;

[NoCoverage] BlockStatement
src/topics/unread.js:356:38
-               if (!hasUnblockedUnread) {
-                   data.read = true;
-               }
+               if (!hasUnblockedUnread) {}

[NoCoverage] BooleanLiteral
src/topics/unread.js:357:29
-                   data.read = true;
+                   data.read = false;

[NoCoverage] BooleanLiteral
src/topics/unread.js:365:72
-           return Array.isArray(hasRead) && hasRead.length ? hasRead[0] : false;
+           return Array.isArray(hasRead) && hasRead.length ? hasRead[0] : true;

[NoCoverage] BlockStatement
src/topics/unread.js:378:37
-           if (parseInt(uid, 10) <= 0) {
-               return [];
-           }
+           if (parseInt(uid, 10) <= 0) {}

[NoCoverage] ArrayDeclaration
src/topics/unread.js:379:20
-               return [];
+               return ["Stryker was here"];

[NoCoverage] BlockStatement
src/topics/user.js:15:43
-       Topics.getUids = async function (tid) {
-           return await db.getSortedSetRevRangeByScore(`tid:${tid}:posters`, 0, -1, '+inf', 1);
-       };
+       Topics.getUids = async function (tid) {};

[NoCoverage] StringLiteral
src/topics/user.js:16:53
-           return await db.getSortedSetRevRangeByScore(`tid:${tid}:posters`, 0, -1, '+inf', 1);
+           return await db.getSortedSetRevRangeByScore(``, 0, -1, '+inf', 1);

[NoCoverage] UnaryOperator
src/topics/user.js:16:78
-           return await db.getSortedSetRevRangeByScore(`tid:${tid}:posters`, 0, -1, '+inf', 1);
+           return await db.getSortedSetRevRangeByScore(`tid:${tid}:posters`, 0, +1, '+inf', 1);

[NoCoverage] StringLiteral
src/topics/user.js:16:82
-           return await db.getSortedSetRevRangeByScore(`tid:${tid}:posters`, 0, -1, '+inf', 1);
+           return await db.getSortedSetRevRangeByScore(`tid:${tid}:posters`, 0, -1, "", 1);
